Model: "latent_to_states_model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 latent_input (InputLayer)      [(None, 256)]        0           []                               
                                                                                                  
 Dense_h_0 (Dense)              (None, 512)          131584      ['latent_input[0][0]']           
                                                                                                  
 Dense_c_0 (Dense)              (None, 512)          131584      ['latent_input[0][0]']           
                                                                                                  
 Dense_h_1 (Dense)              (None, 512)          131584      ['latent_input[0][0]']           
                                                                                                  
 Dense_c_1 (Dense)              (None, 512)          131584      ['latent_input[0][0]']           
                                                                                                  
 BN_h_0 (BatchNormalization)    (None, 512)          2048        ['Dense_h_0[0][0]']              
                                                                                                  
 BN_c_0 (BatchNormalization)    (None, 512)          2048        ['Dense_c_0[0][0]']              
                                                                                                  
 BN_h_1 (BatchNormalization)    (None, 512)          2048        ['Dense_h_1[0][0]']              
                                                                                                  
 BN_c_1 (BatchNormalization)    (None, 512)          2048        ['Dense_c_1[0][0]']              
                                                                                                  
==================================================================================================
Total params: 534,528
Trainable params: 530,432
Non-trainable params: 4,096
__________________________________________________________________________________________________
